Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_PlaygroundBookFormatRef/PlaygroundBookFormatReference-level2.tmx
Source language: en_us
Languages: ja

source: A type used for encoding an array.
ja: 配列をエンコードするために使われるある型。

source: A type used for encoding an integer value.
ja: 整数値をエンコードするために使われる型。

source: A type used for encoding raw binary data.
ja: 生のバイナリデータをエンコードするために使われる型。

source: A unique identifier for the book package.
ja: ブックパッケージのための特有な識別子。

source: A user editing the playground or touching the Stop button stops execution automatically, even when indefinite execution is enabled.
ja: プレイグラウンドを編集しているまたはStopボタンをタッチしているユーザは、自動的に実行を停止します、無期限実行が可能にされている時でさえもです。

source: A value between 0 and 1.0 indicating a peripheral’s percent battery charge.
ja: ある周辺機器のバッテリ充電割合を指し示している 0 と 1.0 の間のある値。

source: A value between 0 and 1.0 indicating the peripheral’s percent battery charge.
ja: その周辺機器のバッテリ充電割合を指し示している 0 と 1.0 の間のある値。

source: A value that indicates whether a peripheral needs a firmware update.
ja: ある値、それはある周辺機器がファームウェアアップデートを必要とするかどうかを示します。

source: A value that indicates whether the specified peripheral needs a firmware update.
ja: ある値、それは指定の周辺機器がファームウェアアップデートを必要とするかどうかを示します。

source: A version number you need to increment when you update the book.
ja: あなたがブックを更新する時にあなたが漸増する必要があるバージョンナンバー。

source: A view controller or view that renders and manages the live view.
ja: ライブビューを描画して管理するビューコントローラまたはビュー。

source: A view controller whose view is displayed as the live view.
ja: ビューがそれのライブビューとして表示される、ビューコントローラ。

source: A view that displays the connection status of a single peripheral to the central manager for the current playground page and that lets you discover, connect to, and disconnect from another peripheral.
ja: あるビュー、それはある単一の周辺機器の接続状態を現在のプレイグラウンドページのためのセントラルマネージャに表示します、そしてそれはあなたに他の周辺機器を発見させ、それに接続させ、およびそれから切断させます。

source: A view that is displayed as the live view.
ja: ライブビューとして表示されるビュー。

source: About Hints
ja: ヒントについて

source: About Page Annotations
ja: ページ注釈について

source: About the Glossary
ja: グロッサリーについて

source: About the PlaygroundBluetooth Framework
ja: PlaygroundBluetoothフレームワークについて

source: About the PlaygroundSupport Module
ja: PlaygroundSupportモジュールについて

source: Access a playground page and manage its execution
ja: プレイグラウンドページにアクセスしてそれのエクステンションを管理する

source: Access network services and handle changes in network configurations.
ja: ネットワークサービスにアクセスしてネットワーク設定における変更を取り扱います。

source: Access the essential classes that define basic object behavior, data types, collections, and operating-system services.
ja: 基本的なオブジェクト挙動、データ型、コレクション、そしてオペレーティングサービスを定義する本質的クラスにアクセスします。

source: Accesses the value associated with the given key in the playground book store for reading and writing.
ja: 指定されたキーに結び付けられた値にプレイグラウンドブック保管庫において読み書きのためにアクセスします。

source: Add a link to the definition of a glossary term on a playground page.
ja: あるプレイグラウンドページ上にグロッサリー用語の定義へのリンクを加えます。

source: Add leaderboards, achievements, matchmaking, challenges, and more.
ja: リーダーボード、業績、マッチメイク、挑戦、その他いろいろを加えます。

source: Add low-latency, positional audio playback and three-dimensional sound to your playground book or game.
ja: 低遅延で、位置オーディオ再生と三次元サウンドをあなたのプレイグラウンドブックまたはゲームに加えます。

source: Add low-level and high-performance kernels to your Metal playground book.
ja: ローレベルで高性能のカーネルをあなたのMetalプレイグラウンドブックに加えます。

source: Add sophisticated audio manipulation and processing capabilities to your playground book.
ja: 洗練されたオーディオ操作および処理能力をあなたのプレイグラウンドブックに加えます。

source: Add user interfaces to audio units.
ja: オーディオヒントにユーザインターフェイスを加えます。

source: Add views to your playground book to display Live Photos content interactively.
ja: あなたのプレイグラウンドブックにビューを加えて、Live Photosコンテンツを双方向に表示します。

source: Added information about creating and publishing subscriptions.
ja: サブスクリプション（定期購読、配信）の作成と出版についての情報を加えた。

source: Added information about localization support.
ja: 現地語化サポートについての情報を加えた。

source: Added information about managing overloads in code completions.
ja: コード補完におけるオーバーロード管理についての情報を加えた。

source: Added information about the PlaygroundBluetooth framework.
ja: PlaygroundBluetoothフレームワークについての情報を加えた。

source: Added information about the Swift Playgrounds Author Template for testing live views, PlaygroundBluetooth, and PlaygroundSupport.
ja: PlaygroundBluetooth、PlaygroundSupport、そしてライブビューをテストするためのSwift Playgrounds Author Templateについての情報を加えた。

source: Added information about the SwiftVersion book manifest key.
ja: SwiftVersionブックマニフェストキーについての情報を加えた。

source: Adding a Glossary.plist file to a book adds the Glossary of Terms menu item to the Tools menu.
ja: Glossary.plistファイルをブックに加えると、Glossary of TermsメニューがToolsメニューに追加されます。

source: Adding a Hints.plist file to a page adds a Hint button to the page.
ja: Hints.plistファイルをページに加えることは、Hintボタンをそのページに加えます。

source: Adding a Hints file for a playground page shows a Hint button, such as the one at the lower right of Figure 15-1.
ja: Hintsファイルをあるプレイグラウンドページに追加することは、Hintボタンを表示します、図 15-1 右下のもののように。

source: Adding editable code areas to a page locks any content outside of those areas.
ja: 編集コードエリアをあるページに加えると、それらのエリアの外側のあらゆるコンテンツは固定されます。

source: Adding, removing, or updating the subscription involves two steps: creating a new or updated playground book, then adjusting the JSON feed so it corresponds to the updates you've just made.
ja: サブスクリプションの追加、削除、または更新は２つの段階を必然的に含みます：新規のまたは更新されたプレイグラウンドブックを作成すること、それからあなたがちょうど作成した更新にそれが適合するようJSONフィードを整えること。

source: Additionally, on pages with at least one editable area, you can place hidden code anywhere on the page outside of an editable area.
ja: さらに加えて、少なくとも１つの編集エリアを持つページでは、あなたは非表示コードをページ上の編集エリアの外側のどこにでも置くことが出来ます。

source: Adds information about copying code between playground pages.
ja: プレイグラウンドページ間でのコードのコピーについての情報を加えた。

source: All content on the page outside of editable areas is read-only.
ja: 編集エリアの外側のページ上のすべてのコンテンツは、読み出しのみです。

source: All content on the page that is outside of editable areas is read-only.
ja: 編集エリアの外側である、ページ上のすべてのコンテンツは、読み出しのみです。

source: All of the methods of this protocol are optional.
ja: このプロトコルのメソッドのすべては、オプショナルです。

source: Allows the handler to receive a live view message as a PlaygroundValue from a remote object.
ja: ライブビューメッセージをリモートオブジェクトからのPlaygroundValueとして受け取ることをハンドラに可能にします。

source: Allows the handler to receive a live view message from a remote object .
ja: ハンドラにライブビューメッセージをリモートオブジェクトから受け取らせます。

source: Allows the handler to receive a message from an always-on remote live view proxy.
ja: ハンドラに常時接続のリモートライブビュープロキシからのメッセージを受け取るようにします。

source: Allows the handler to send a message to a remote object.
ja: メッセージをリモートオブジェクトに送ることをハンドラに可能にします。

source: Almost any web host meets the requirements for putting a playground subscription online.
ja: ほとんど全てのウェブホストは、プレイグラウンドサブスクリプションをオンラインに置くための要件を満たします。

source: Although the quotation marks appear inside the editable code delimiters, they are not editable.
ja: それらクォーテーション記号は編集コード区切り記号の内側に現れますが、それらは編集可能ではありません。

source: An Example Subscription Feed
ja: サブスクリプションフィードの例

source: An array of URLs to images that highlight parts of the book.
ja: ブックの呼び物部分の画像へのURLからなる配列。

source: An array of objects representing the playground books in your feed.
ja: あなたのフィードの中のプレイグラウンドを表しているオブジェクトからなる配列。

source: An array of objects you use to supply metadata.
ja: 幾らかのオブジェクトからなるあるリスト、あなたがメタデータを供給するために使います。

source: An array of service identifiers that the central manager scans for.
ja: セントラルマネージャが走査する幾つかのサービス識別子の配列。

source: An array of the .playgroundchapter folders used for the chapters in a book.
ja: ブックの章のために使われるいくらかの.playgroundchapterフォルダからなるある配列。

source: An array of the .playgroundpage and .cutscenepage folders used for the pages in a chapter.
ja: ある章の中の様々なページに対して使われる.playgroundpageおよび.cutscenepageフォルダの配列。

source: An array of the peripherals currently connected to the central manager.
ja: 現在セントラルマネージャに接続される周辺機器の配列。

source: An edit area inserted between line 1 and line 2 shows no completions in the shortcut bar because the delimiter on line 1 hides everything.
ja: 行１と２の間に挿入される編集エリアは、ショートカットバーにおいて補完を表示しません、なぜなら行１での区切り記号がすべてのものを隠すからです。

source: An enumeration of the types that can be saved in the key-value store and can be exchanged in messages with always-on live views.
ja: いくらかの型からなる列挙、それはキー値保管庫に保存されることができ、常時接続のライブビューとメッセージを交換されることができます。

source: An enumeration that describes the supported representations for live views in playgrounds.
ja: ある列挙、それはプレイグラウンドの中のライブビューに対してサポートされる表現を記述します。

source: An enumeration that you use to indicate whether a peripheral’s firmware is current.
ja: ある列挙、それはある周辺機器のファームウェアが最新かどうかを指し示すためにあなたが使用します。

source: An enumeration used for getting and setting the current assessment state of a playground page and providing optional feedback to the user.
ja: ある列挙で、プレイグラウンドページの現在の評価状態の取得や設定をすることおよびユーザに対する随意のフィードバックの提供することのために使われます。

source: An error which describes the reason for the connection failure.
ja: あるエラー、接続失敗の理由を表します。

source: An error which, if present, describes the reason for the connection failure.
ja: あるエラー、もし存在するならば、それは接続失敗の理由を記述します。

source: An icon indicating that a peripheral may not function correctly.
ja: ある周辺機器が正しく機能しないかもしれないことを示すアイコン。

source: An icon indicating that the specified peripheral may not function correctly.
ja: 指定の周辺機器が正しく機能しないかもしれないことを示すアイコン。

source: An icon that represents the specified peripheral.
ja: あるアイコン、それは指定の周辺機器を表します。

source: An image indicating that a peripheral may not function correctly.
ja: ある周辺機器が正しく機能しないかもしれないことを示す画像。

source: An image shown before the live view runs.
ja: ある画像をそのライブビューが動作する前に表示します。

source: An image that represents a peripheral.
ja: ある接続機器を表している画像。

source: An individual page containing a cutscene
ja: あるカットシーンを含んでいる個々のページ

source: An individual page containing a playground and an optional, always-on live view
ja: あるプレイグラウンドおよびある任意の、常時接続ライブビューを含んでいる個々のページ

source: An instance that holds information about a peripheral displayed in a connection view.
ja: ある接続ビューの中で表示されるひとつの周辺機器についての情報を保持するインスタンス。

source: An object that enables message passing between a live view and the main playground page.
ja: あるオブジェクト、それはライブビューとメインプレイグラウンドページの間で渡されるメッセージを可能にします。

source: An object that represents a key-value data store for the playground book.
ja: あるオブジェクト、それはプレイグラウンドブックのためのキー値データ保管庫を表します。

source: An object that represents the state of a playground page and enables you to interact with the Swift Playgrounds live view.
ja: あるオブジェクト、それはプレイグラウンドページの状態を表して、あなたにSwift Playgroundsライブビューとの相互作用を可能にします。

source: An optional file used to specify an always-on live view; the code in this file is executed when the page is opened
ja: 常時接続のライブビューを指定する任意のファイル；このファイルの中のコードはページが開かれる時に実行されます

source: An optional glossary adds a list of terms and definitions to a playground book.
ja: 随意のグロッサリーは、プレイグラウンドブックに用語と定義のリストを追加します。

source: Annotate your maps with points of interest, and determine placemark information for map coordinates.
ja: あなたの地図に興味ある地点で注釈をつけます、そしてプレイスマーク情報を地図座標に対して特定します。

source: Any content between the delimiters is editable by the user and includes code, placeholders, comments, and markup.
ja: 区切り記号の間の何らかのコンテンツはユーザによって編集可能です、そしてコード、プレースホルダ、コメント、そしてマークアップを含みます。

source: Any changes to a book, such as adding a new page, require modifying content files, manifest files, and the folder structure.
ja: ブックに対するあらゆる変更、例えば新しいページの追加などは、内容ファイル、マニフェストファイル、そしてフォルダ構造の修正を必要とします。

source: Any code snippet in the comma-separated list of arguments
ja: コンマ区切りの引数のリストの中の何らかのコードスニペット

source: Any content that is outdented beyond the indentation level of the multiline editable area delimiters is invalid and renders incorrectly.
ja: 複数行編集エリア区切り記号の字下げ水準を越えて字下げを戻されるあらゆる内容は、無効です、そして不正確に描画されます。

source: Any existing hints are replaced.
ja: あらゆる既存のヒントは置き換えられます。

source: Any hint can have a spoiler button.
ja: どんなヒントもスポイラーボタンを持つことができます。

source: Any keyword in the comma-separated list of arguments
ja: コンマ区切りの引数のリストの中の何らかのキーワード

source: Any literal in the comma-separated list of arguments
ja: コンマ区切りの引数のリストの中の何らかのリテラル

source: Any public identifier in the comma-separated list of arguments
ja: コンマ区切りの引数のリストの中の何らかのパブリック識別子

source: Any public symbol from any module
ja: 何らかのモジュールからの何らかのパブリックシンボル

source: Any public symbol from the Swift source files in the Sources directory for the book
ja: ブックのためのSourcesディレクトリにおけるSwiftソースファイルからの何からのパブリックシンボル。

source: Any public symbol from the Swift source files in the Sources directory for the current chapter
ja: 現在の章のためのSourcesディレクトリにおけるSwiftソースファイルからの何からのパブリックシンボル。

source: Any public symbol from the Swift source files in the Sources directory for the current page
ja: 現在のページのためのSourcesディレクトリにおけるSwiftソースファイルからの何からのパブリックシンボル。

source: Any public symbol from the current playground page
ja: 現在のプレイグラウンドページからの何らかのパブリックシンボル

source: Any public symbol in the comma-separated list of strings.
ja: コンマ区切りの文字列のリストの中の何らかのパブリック識別子。

source: Any public symbol in the specified modules
ja: 指定されたモジュールからの何らかのパブリックシンボル

source: Any resources that you don’t want users to access, such as localization or hints files, go in a PrivateResources folder.
ja: ユーザがアクセスするのをあなたが望まないあらゆるリソース、例えばローカライズまたはヒントファイルは、PrivateResourcesフォルダにしまいます。

source: Any resources that you want users to be able to access from the file picker or image picker go in a PublicResources folder.
ja: ユーザがファイルピッカーまたはイメージピッカーからアクセス可能であるのをあなたが望むあらゆるリソースは、PublicResourcesフォルダにしまいます。

source: Apply high-performance image analysis and computer vision techniques to identify faces, detect features, and classify scenes in images and video.
ja: 高性能の画像分析およびコンピュータビジョン技術を適用して、顔識別、特徴検出、そして場面分類を画像とビデオにおいて行います。

source: Array of strings
ja: いくらかの文字列からなるArray

source: Assessment status for a page is initialized to nil, indicating that the page has not been assessed.
ja: あるページに対する評価状態はnilに初期化されいて、そのページが評価され終わっていないことを指し示します。

source: AssessmentStatus Enumeration
ja: AssessmentStatus列挙

source: Associated values
ja: 関連値

source: At the top is the book, then the chapters, and finally the individual pages and their content.
ja: 一番上にはそのブックが、それから章、そして最終的に個々のベージとそれらの内容になります。

source: Attempts to connect the central manager to a peripheral with the specified unique identifier.
ja: セントラルマネージャを指定の固有識別子を持つ周辺機器に接続することを試みます。

source: Attempts to connect the central manager to the specified peripheral.
ja: セントラルマネージャを指定の周辺機器と接続することを試みます。

source: Attempts to reconnect the central manager to the most recently connected peripheral.
ja: セントラルマネージャをごく最近接続した周辺機器に再接続することを試みます。

source: Available Frameworks
ja: 利用可能なフレームワーク

source: Banner images should be 1080px × 400px.
ja: バナー画像は、1080px × 400pxでなければなりません。

source: Be sure to note the URLs that your web host uses to store each file; you'll use these to fill in the parts of the feed format described in Subscription Feed Format with URLs customized to your specific web host and your playground subscription.
ja: あなたのウェブホストが各ファイルを格納するのに使うURLを忘れず書き留めてください；あなたはそれらを使ってSubscription Feed Formatで記述されるフィード書式の各部を、あなたの指定ウェブホストとあなたのプレイグラウンドサブスクリプションへのあつらえのURLで満たします。

source: Binary data can be used to represent objects initialized from custom classes.
ja: バイナリデータは、カスタムクラスからイニシャライザされたオブジェクトを表すために使われることができます。

source: Book
ja: ブック

source: Book Manifest
ja: ブックマニフェスト

source: Build Metal playground books quicker and easier, using far less code.
ja: Metalプレイグラウンドブックをより素早くより簡単に、ずっと少ないコードを使って構築します。

source: Build code that you can use across Apple platforms, and share code and data among frameworks, libraries, apps, and playground books.
ja: いくつかのAppleプラットホームに渡って使うことができるコードを組み立てます、そしてコードとデータをフレームワーク、ライブラリ、アプリ、そしてプレイグラウンドブックの間で共有します。

source: Build on abstractions of network protocols to simplify tasks such as working with BSD sockets, administering HTTP and FTP servers, and managing Bonjour services.
ja: 単純な作業、例えばBSDソケットを扱う、HTTPおよびFTPサービスを運営する、およびBonjourサービスの管理などに対して、ネットワークプロトコルの抽象性を構築します。

source: Building a Landing Page for Your Playgrounds
ja: あなたのプレイグラウンドのランディングページを作る

source: By annotating your playground page source code, you can add editable code areas, hide code, and customize the results of code completion in playground pages.
ja: あなたのプレイグラウンドページソースコードに注釈をつけることによって、あなたは編集可能コードエリアを加える、コードを隠す、そしてプレイグラウンドページにおいてコード完成の結果をカスタマイズすることが可能です。

source: By convention, comments are enclosed inside C-style comment delimiters (/* and */) and are placed immediately before the entry they describe.
ja: 慣行によって、コメントはC形式コメント区切り記号（/*と*/）の内側に納められます、そしてそれらが解説する登録項目のすぐ前に置かれます。

source: By default, UIView and UIViewController conform to this protocol on iOS.
ja: 初期状態で、UIViewとUIViewControllerはiOSでこのプロトコルに準拠します。

source: By default, all top-level code is executed, and then execution stops.
ja: 初期状態で、すべてのトップレベルコードが実行されて、それから実行は停止します。

source: Calling this method requires an open connection to a remote object.
ja: このメソッドの呼び出しは、リモートオブジェクトへの開いた接続が必要です。

source: Changes made to a book in Swift Playgrounds, such as entering code into an editable text field, do not change the underlying pages.
ja: ブックに対してSwift Playgroundsの中で行われた変更、例えば編集可能なテキストフィールドへのコード入力などは、その下にあるページを変更しません。

source: Changing the size of the live view, by making it full screen or by rotating the device, changes the size of the safe area as shown in the following screenshot.
ja: それをフルスクリーンにすることによってまたはデバイスを回転することによって、ライブビューの大きさを変更することは、安全領域の大きさを以下のスクリーンショットで示すように変更します。

source: Chapter
ja: 章

source: Chapter Manifest
ja: 章マニフェスト

source: Chapters Key
ja: Chaptersキー

source: Class Properties
ja: クラスプロパティ

source: CodeCopySetup Key
ja: CodeCopySetupキー

source: Combine the two URLs to form a link on your site.
ja: ２つのURLを組み合わせて、あなたのサイト上のリンクを形成してください。

source: Comment Markers
ja: コメントマーカー

source: Communicate with Bluetooth low-energy devices.
ja: Bluetooth low-energyデバイスと通信します。

source: Communicate with MIDI devices such as hardware keyboards and synthesizers.
ja: MIDIデバイス、例えばハードウェアキーボードやシンセサイザと通信します。

source: Communicate with accessories connected to a device by the Apple Lightning connector, or connected wirelessly through Bluetooth.
ja: Apple Lightningコネクタ、またはBluetoothを通してワイヤレスに接続されることによって、デバイスに接続されたアクセサリと通信します。

source: Completions
ja: 補完

source: Configuration for copying code between playground pages.
ja: プレイグラウンドページ間でのコードのコピーについての設定。

source: Configuration information, playground contents, and the source code for always-on live views are in specially named files.
ja: 構成情報、いくらかのプレイグラウンド内容、そして常時接続のライブビューのためのソースコードは、特有名前ファイルの中に入れます。

source: Configure and schedule the delivery of location-related events.
ja: 位置に関連したイベントの送付を構成設定して予定に入れます。

source: Configure user interface animations and visual effects using Core Animation technology for hardware rendering and optimal performance.
ja: ユーザインターフェイスアニメーションとビジュアル効果を、ハードウェアレンダリングと最善の性能のためにCore Animationテクノロジーを使って構成します。

source: Conforms To
ja: 次に準拠

source: Construct and manage your playground book's UI.
ja: あなたのプレイグラウンドブックのUIを構築して管理します。

source: Containing folder
ja: 含まれているフォルダ

source: Containing folders
ja: 含んでいるフォルダ

source: Contains all the chapter folders for the book
ja: ブックの全ての章フォルダを含みます

source: Contains all the other files and folders for the playground book
ja: プレイグラウンドブックの全ての他のファイルとフォルダを含みます

source: Contains all the page folders for the chapter
ja: 章の全てのページフォルダを含みます

source: Contains interfaces for playing audio content.
ja: 再生中のオーディオコンテンツのためのインターフェイスを含みます。

source: Content Hierarchy
ja: コンテンツ階層

source: Content Key
ja: Contentキー

source: ContentIdentifier Key
ja: ContentIdentifierキー

source: ContentVersion Key
ja: ContentVersionキー

source: Controls the display of results for executed playground statements.
ja: 実行されたプレイグラウンド文の結果の表示を制御します。

source: Controls the display of results in playground pages.
ja: プレイグラウンドページにおける結果の表示を制御します。

source: Coordinate the presentation of closed-captioned data for your playground book's media files.
ja: あなたのプレイグラウンドブックのメディアファイルのための聴力障害者用字幕（クローズドキャプション）データの提示を調整します。

source: Copy of Editable Area Code Between Pages
ja: ページ間での編集エリアコードのコピー

source: CopyCommandButtonTitle Key
ja: CopyCommandButtonTitleキー

source: Create 2D sprite-based games using an optimized animation system, physics simulation, and event-handling support.
ja: 2Dスプライト基盤のゲームを、最適化されたアニメーションシステム、物理シミュレーション、そしてイベント処理サポートを使って作成します。

source: Create 3D and 2D graphics effects with this compact, efficient subset of OpenGL.
ja: 3Dおよび2Dグラフィック効果をこのコンパクトで、能率的なOpenGLサブセットを使って作成します。

source: Create 3D games and add 3D content to playground books.
ja: 3Dゲームを作成して、3Dコンテンツをプレイグラウンドブックに追加します。

source: Create a user interface for composing email and text messages, so users can edit and send messages without leaving your playground book.
ja: emailとテキストメッセージを創作するためのインターフェイスを作成します、それでユーザはあなたのプレイグラウンドブックを去ることなくメッセージを編集して送信できます。

source: Create audio unit extensions that generate or modify audio in a host playground book.
ja: オーディオユニット拡張を作成します、それはホストプレイグラウンドブックにおいてオーディオを生成または修正します。

source: Create custom extensions for editing photo, video, and Live Photos content in the Photos app.
ja: Photosアプリでの写真、ビデオ、そしてLive Photosコンテンツを編集するためのカスタム拡張を作成します。

source: Create experiences that keep players coming back to your game.
ja: プレイヤーがあなたのゲームに戻って行き続ける体験を作成します。

source: Create generalized and automated solutions to common tasks associated with object life-cycle and object graph management, including persistence.
ja: 永続性を含む、オブジェクトライフサイクルとオブジェクトグラフ管理に関連した一般的作業に対して、帰納および自動化された解決策を作成します。

source: Create text layouts using high-quality typesetting, character-to-glyph conversion, and positioning of glyphs in lines and paragraphs.
ja: テキストレイアウトを高品質の活字組、文字とグリフ間変換、そして行および段落でのグリフの位置指定を使って作成します、

source: Create view-level services for media playback, complete with user controls, chapter navigation, and support for subtitles and closed captioning.
ja: メディア巻き戻し再生のためのビューレベルのサービスを作成します、ユーザコントロール、文字ナビゲーション、そして字幕および聴力障害者用字幕（クローズドキャプション）を完備します。

source: Creates a central manager that supports communicating with Bluetooth peripherals.
ja: セントラルマネージャを作成します、それはBluetooth周辺機器との接続をサポートするものです。

source: Creates a new, empty view that can be populated with items when peripherals are connected to the central manager.
ja: 新しい、空のビューを作成します、それは周辺機器がセントラルマネージャに接続される時にいくつかの項目で満たされることが出来るものです。

source: Creates a structure that holds information about a peripheral displayed in a connection view.
ja: ある接続ビューの中で表示されるひとつの周辺機器についての情報を保持する構造体を作成します。

source: Creating Playground Books
ja: プレイグラウンドブックを作成する

source: Creating Subscriptions
ja: サブスクリプションの作成

source: Customized Code Completion
ja: カスタマイズされたコード補完

source: Cutscene Page Manifest
ja: カットシーンページマニフェスト

source: Cutscene start page
ja: カットシーン開始ページ

source: CutsceneReference Key
ja: CutsceneReferenceキー

source: Dates must be ISO 8601-formatted date strings.
ja: 日付は、ISO 8601書式化された日付文字列でなければなりません。

source: Declaration
ja: 宣言

source: Default implementation provided.
ja: 省略時の実装の提供。

source: DefaultCommandButtonTitle Key
ja: DefaultCommandButtonTitleキー

source: Define the editable area by placing it between the editable-code and end-editable-code delimiters.
ja: 編集可能なエリアを、それをeditable-codeとend-editable-code区切り記号の間に置くことによって定義してください。

source: Define the inline editable area by placing it between the editable-code and end-editable-code delimiters.
ja: インライン編集エリアの定義は、それをeditable-codeとend-editable-code区切り記号の間に置くことによって行います。

source: Definition Key
ja: Definitionキー

source: DeploymentTarget Key
ja: DeploymentTargetキー

source: Description
ja: 説明

source: Detect features such as faces and eyes, and track faces in video images.
ja: 顔や目のような特徴を検出して、ビデオイメージにおいて顔を追跡します。

source: Determine the current latitude and longitude of a device.
ja: デバイスの現在の緯度と経度を判定します。

source: Disconnects the central manager from the specified, connected peripheral.
ja: セントラルマネージャを指定の、接続された周辺機器から切断します。

source: Discover connected controllers, connect new controllers to a device, and read the inputs of connected controllers.
ja: 接続されたコントローラを発見して、新しいコントローラをデバイスに接続します、そして接続されたコントローラの入力を読み込みます。

source: Discussion
ja: 解説

source: Dismiss an open live view by setting liveView to nil.
ja: 開いているライブビューを、liveViewをnilに設定することで片付けてください。
